In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('student-mat.csv', sep=';')
df

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
391,MS,M,17,U,LE3,T,3,1,services,services,...,2,4,5,3,4,2,3,14,16,16
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

In [3]:
df.dtypes, type(df.dtypes)

(school        object
 sex           object
 age            int64
 address       object
 famsize       object
 Pstatus       object
 Medu           int64
 Fedu           int64
 Mjob          object
 Fjob          object
 reason        object
 guardian      object
 traveltime     int64
 studytime      int64
 failures       int64
 schoolsup     object
 famsup        object
 paid          object
 activities    object
 nursery       object
 higher        object
 internet      object
 romantic      object
 famrel         int64
 freetime       int64
 goout          int64
 Dalc           int64
 Walc           int64
 health         int64
 absences       int64
 G1             int64
 G2             int64
 G3             int64
 dtype: object,
 pandas.core.series.Series)

In [4]:
df.health

0      3
1      3
2      3
3      5
4      5
      ..
390    4
391    2
392    3
393    5
394    5
Name: health, Length: 395, dtype: int64

In [5]:
df.health.astype('float64')

0      3.0
1      3.0
2      3.0
3      5.0
4      5.0
      ...
390    4.0
391    2.0
392    3.0
393    5.0
394    5.0
Name: health, Length: 395, dtype: float64

In [6]:
df.count()

school        395
sex           395
age           395
address       395
famsize       395
Pstatus       395
Medu          395
Fedu          395
Mjob          395
Fjob          395
reason        395
guardian      395
traveltime    395
studytime     395
failures      395
schoolsup     395
famsup        395
paid          395
activities    395
nursery       395
higher        395
internet      395
romantic      395
famrel        395
freetime      395
goout         395
Dalc          395
Walc          395
health        395
absences      395
G1            395
G2            395
G3            395
dtype: int64

In [7]:
df_n = pd.DataFrame({
    'col1': [10,20,30],
    'col2': [40,50,60],
    'col3': [70,None,90],
    }
)
df_n

   col1  col2  col3
0    10    40  70.0
1    20    50   NaN
2    30    60  90.0

In [8]:
df_n.isnull().values.any()

np.True_

In [9]:
df_n.values

array([[10., 40., 70.],
       [20., 50., nan],
       [30., 60., 90.]])

In [10]:
df_n.any(), pd.DataFrame({'1':[None]}).any()

(col1    True
 col2    True
 col3    True
 dtype: bool,
 1    False
 dtype: bool)

In [11]:
df.sum()

school        GPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGPGP...
sex           FFFFFMMFMMFFMMMFFFMMMMMMFFMMMMMMMMMFMMFFFMMMFF...
age                                                        6595
address       UUUUUUUUUUUUUUUUUUUUUUUURUUUUUUURUUUURRRUUUUUU...
famsize       GT3GT3LE3GT3GT3LE3LE3GT3LE3GT3GT3GT3LE3GT3GT3G...
Pstatus       ATTTTTTAATTTTTATTTTTTTTTTTTTATTTTTTTTATTTTTTTA...
Medu                                                       1086
Fedu                                                        996
Mjob          at_homeat_homeat_homehealthotherservicesothero...
Fjob          teacherotherotherservicesotherotherotherteache...
reason        coursecourseotherhomehomereputationhomehomehom...
guardian      motherfathermothermotherfathermothermothermoth...
traveltime                                                  572
studytime                                                   804
failures                                                    132
schoolsup     yesnoyesnonononoyesnononononononononoyesnonono...
famsup        noyesnoyesyesyesnoyesyesyesyesyesyesyesyesyesy...
paid          nonoyesyesyesyesnonoyesyesyesnoyesyesnonoyesno...
activities    nononoyesnoyesnononoyesnoyesyesnononoyesyesyes...
nursery       yesnoyesyesyesyesyesyesyesyesyesyesyesyesyesye...
higher        yesyesyesyesyesyesyesyesyesyesyesyesyesyesyesy...
internet      noyesyesyesnoyesyesnoyesyesyesyesyesyesyesyesy...
romantic      nononoyesnonononononononononoyesnonononononono...
famrel                                                     1558
freetime                                                   1278
goout                                                      1228
Dalc                                                        585
Walc                                                        905
health                                                     1404
absences                                                   2255
G1                                                         4309
G2                                                         4232
G3                                                         4114
dtype: object

In [12]:
df_n.sum()

col1     60.0
col2    150.0
col3    160.0
dtype: float64

In [13]:
df_n.isnull(), df_n.isnull().sum()

(    col1   col2   col3
 0  False  False  False
 1  False  False   True
 2  False  False  False,
 col1    0
 col2    0
 col3    1
 dtype: int64)

In [14]:
df.loc[df['absences'] == 0, 'absences'] = None

In [15]:
pd.isnull(df.absences)

0      False
1      False
2      False
3      False
4      False
       ...
390    False
391    False
392    False
393     True
394    False
Name: absences, Length: 395, dtype: bool

In [16]:
df[pd.isnull(df.absences)]

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
6,GP,M,16,U,LE3,T,2,2,other,other,...,4,4,4,1,1,3,NaN,12,12,11
8,GP,M,15,U,LE3,A,3,2,services,other,...,4,2,2,1,1,1,NaN,16,18,19
9,GP,M,15,U,GT3,T,3,4,other,other,...,5,5,1,1,1,5,NaN,14,15,15
10,GP,F,15,U,GT3,T,4,4,teacher,health,...,3,3,3,1,2,2,NaN,10,8,9
14,GP,M,15,U,GT3,A,2,2,other,other,...,4,5,2,1,1,3,NaN,14,16,16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
383,MS,M,19,R,GT3,T,1,1,other,services,...,4,3,2,1,3,5,NaN,6,5,0
387,MS,F,19,R,GT3,T,2,3,services,other,...,5,4,2,1,2,5,NaN,7,5,0
388,MS,F,18,U,LE3,T,3,1,teacher,services,...,4,3,4,1,1,1,NaN,7,9,8
389,MS,F,18,U,GT3,T,1,1,other,other,...,1,1,1,1,1,5,NaN,6,5,0
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,NaN,11,12,10

In [17]:
df.absences.fillna('No Absense')

0             6.0
1             4.0
2            10.0
3             2.0
4             4.0
          ...
390          11.0
391           3.0
392           3.0
393    No Absense
394           5.0
Name: absences, Length: 395, dtype: object

In [18]:
df.loc[393]

school              MS
sex                  M
age                 18
address              R
famsize            LE3
Pstatus              T
Medu                 3
Fedu                 2
Mjob          services
Fjob             other
reason          course
guardian        mother
traveltime           3
studytime            1
failures             0
schoolsup           no
famsup              no
paid                no
activities          no
nursery             no
higher             yes
internet           yes
romantic            no
famrel               4
freetime             4
goout                1
Dalc                 3
Walc                 4
health               5
absences           NaN
G1                  11
G2                  12
G3                  10
Name: 393, dtype: object

In [19]:
df.absences.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
390    False
391    False
392    False
393     True
394    False
Name: absences, Length: 395, dtype: bool

In [20]:
df_n.col3.isnull()

0    False
1     True
2    False
Name: col3, dtype: bool

In [21]:
df_n.col3.notnull().sum()

np.int64(2)

In [22]:
df_n.isnull().sum()

col1    0
col2    0
col3    1
dtype: int64

In [23]:
s = pd.Series([1, 2, 3, 4, 5])
s.replace(1, 5)

0    5
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 0, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df.replace(0, -1) #inplace=True

   A  B  C
0 -1  5  a
1  1  6  b
2  2 -1  c
3  3  8  d
4  4  9  e

In [25]:
df.replace([0, 1], 4)

   A  B  C
0  4  5  a
1  4  6  b
2  2  4  c
3  3  8  d
4  4  9  e

In [26]:
df.replace([2, 3], [4, 3])

   A  B  C
0  0  5  a
1  1  6  b
2  4  0  c
3  3  8  d
4  4  9  e

In [27]:
df.replace({0: 10, 1: 100})

     A   B  C
0   10   5  a
1  100   6  b
2    2  10  c
3    3   8  d
4    4   9  e

In [28]:
df.replace({'A': 0, 'B': 5}, 100)

     A    B  C
0  100  100  a
1    1    6  b
2    2    0  c
3    3    8  d
4    4    9  e

In [29]:
df.replace({'A': {0:100, 4:400}})

     A  B  C
0  100  5  a
1    1  6  b
2    2  0  c
3    3  8  d
4  400  9  e

In [30]:
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  0  c
3  3  8  d
4  4  9  e

In [31]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [32]:
s.describe()

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [33]:
s1 = pd.Series([15,10])
s1

0    15
1    10
dtype: int64

In [34]:
s1.describe()

count     2.000000
mean     12.500000
std       3.535534
min      10.000000
25%      11.250000
50%      12.500000
75%      13.750000
max      15.000000
dtype: float64

In [35]:
s2 = pd.Series([19, 20, 21, 22, 23, 24, 25, 26, 27])
s2.describe()

count     9.000000
mean     23.000000
std       2.738613
min      19.000000
25%      21.000000
50%      23.000000
75%      25.000000
max      27.000000
dtype: float64

In [84]:
s3 = pd.Series([16, 16, 17, 21, 28, 31, 39, 39])
s3.describe()

count     8.000000
mean     25.875000
std       9.804336
min      16.000000
25%      16.750000
50%      24.500000
75%      33.000000
max      39.000000
dtype: float64

In [85]:
0.75*(17 - 16)

0.75

In [38]:
0.25*(39 - 31)

2.0

In [39]:
df_ = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [0, 1, 2, 3, 4],
                   'C': ['a', 'b', 'c', 'd', 'e']})

In [40]:
df_

   A  B  C
0  0  0  a
1  1  1  b
2  2  2  c
3  3  3  d
4  4  4  e

In [42]:
df_.replace({0:20, 1:30})

    A   B  C
0  20  20  a
1  30  30  b
2   2   2  c
3   3   3  d
4   4   4  e

In [44]:
df_.replace({'A': {0:100, 3:100}})

     A  B  C
0  100  0  a
1    1  1  b
2    2  2  c
3  100  3  d
4    4  4  e

In [46]:
df_.replace({'A': 0, 'B': 8}, 100)

     A  B  C
0  100  0  a
1    1  1  b
2    2  2  c
3    3  3  d
4    4  4  e

In [48]:
df_.replace({'A': {0: 100, 4: 400}, 'B': {2: 200, 3:300}})

     A    B  C
0  100    0  a
1    1    1  b
2    2  200  c
3    3  300  d
4  400    4  e

In [49]:
df.replace({'A': {0: 100, 4: 400}, 'B': {6: 200, 8:300}})

     A    B  C
0  100    5  a
1    1  200  b
2    2    0  c
3    3  300  d
4  400    9  e

In [50]:
s = pd.Series(range(5))
s.where(s > 0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [96]:
s.where(s > 0, 20)

0    20
1     1
2     2
3     3
4     4
dtype: int64

In [51]:
s.mask(s > 0)

0    0.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [54]:
s = pd.Series(range(5))
t = pd.Series([True, False, True, False, True])
s.where(t, 99)

0     0
1    99
2     2
3    99
4     4
dtype: int64

In [57]:
s.where(pd.Series([]), 88)

0    88
1    88
2    88
3    88
4    88
dtype: int64

This replaces value if the condition is False

In [93]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [62]:
s.where(df.A > 2, 10)

0    10
1    10
2    10
3     3
4     4
dtype: int64

This replaces value if the condition is True

In [63]:
s.mask(df.A > 2, 10)

0     0
1     1
2     2
3    10
4    10
dtype: int64

In [100]:
import numpy as np
df_n = pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])
df_n

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [102]:
df_n = pd.DataFrame({'A': [0,2,4,6,8], 'B': [1,3,5,7,9]})
df_n

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [74]:
df_n%3

   A  B
0  0  1
1  2  0
2  1  2
3  0  1
4  2  0

In [88]:
m = df_n%3 == 0
m

       A      B
0   True  False
1  False   True
2  False  False
3   True  False
4  False   True

In [99]:
df_n.where(m, -df_n)

   A  B
0  0 -1
1 -2  3
2 -4 -5
3  6 -7
4 -8  9

In [89]:
~m

       A      B
0  False   True
1   True  False
2   True   True
3  False   True
4   True  False

In [90]:
~pd.Series([True, False])

0    False
1     True
dtype: bool

In [91]:
df.where(m, -df) == df.mask(~m, -df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True

In [95]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 0, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df

   A  B  C
0  0  5  a
1  1  6  b
2  2  0  c
3  3  8  d
4  4  9  e